lang/erlang.html
---
layout: page
title: Erlang
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Erlang</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Kommentare: <code>%</code> (keine multiline Kommentare)
</li>
<li>Variablen groß schreiben
</li>
<li>Atome klein schreiben, z.B. <code>nothing</code>
</li>
<li>Variablen werden groß geschrieben, z.B. <code>X</code>
</li>
<li>Variable können nur einmal gebunden werden. Mit <code>f(X)</code> kann man sie
danach wieder frei geben
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Erlang</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Wofür Prozesse registrieren und welche?</h3>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Robust programmieren in Erlang</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Robust Programmierung in Erlang folgt dem Prizip: <i>die easy and
often</i> und erfolgt über <b>linking</b> von Prozessen:
</p>

<ul class="org-ul">
<li>für lokale Prozesse übernimmt die Erlang Virtual Machine das
Benachrichten der verlinkten Prozess, wenn ein Prozess stirbt.
</li>
<li>für remote Prozesse auf andereren Knoten wird über regelmäßige
Poll-Nachrichten geprüft, ob diese noch am Leben sind
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Sematik von <code>receive</code> verstehen. Erklären anhand eines kleines Beispielprogramms</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Kompilieren von Erlang Quellcode
<ul class="org-ul">
<li>in der Erlang Shell: <code>c(⟨Modulname⟩).</code>
</li>
<li>in der Bash: <code>erlc (⟨Modulname⟩)</code>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Prozesse</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>jeder Prozess hat eine <b>mailbox</b>
</li>
<li>Nachricht werden mit <code>receive</code> aus der mailbox entnommen
<ul class="org-ul">
<li>die Nachrichten in der mailbox werden dabei nach dem FIFO Prinzip
abgearbeitet (nicht gematchte Nachrichten verbleiben dabei jedoch
in der Queue)
</li>
<li>die pattern werden dabei von oben nach unte abgearbeitet. Das erst
matchende Pattern wird verwendet.
</li>
</ul>
</li>
<li>Jeder Prozess hat eine <b>PID</b>. Die <b>PID</b> des laufenden Prozesses
erhält man mit <code>self()</code>
</li>
<li>Prozessen kann man mit <code>!</code> Nachrichten senden, z.B. <code>self()!hallo</code>
</li>
</ul>

<pre class="example">
-module(database).
-export([start/0]).

start() -&gt; spawn(fun() -&gt; database([]) end).

database(KVs) -&gt;
  receive
    {allocate,Key,P} -&gt;
      case fac:lookup(Key,KVs) of
        nothing -&gt; P!free,
                   receive
                     {value,V,P} -&gt; database([{Key,V}|KVs])
                   end;
        {just,_} -&gt; P!allocated;
      end;
    {lookup,Key,P} -&gt; P!fac:lookup(Key,KVs),
                      database(KVs)
  end.
</pre>

<p>
<code>spawn(Funktion)</code> geniert einen Prozess und gitb den PID des Prozesse
zurück
</p>

<pre class="example">
-module(phil).
-export([start/0]).
%-import([]).

newStick() -&gt; spawn(fun() -&gt; stickDown() end).

stickDown() -&gt;
  receive
    {take,P} -&gt; P!took, stickUp()
  end.

stickUp() -&gt;
  receive
    put -&gt; stickDown()
  end.

take(S) -&gt; S!take{take,self()},
           receive
             took -&gt; ok
           end.

put(S) -&gt; S!put.

start() -&gt;
  S1 = newStick(),
  S2 = newStick(),
  S3 = newStick(),
  S4 = newStick(),
  S5 = newStick(),
  spawn(fun() -&gt; phil(1, S1, S2) end),
  spawn(fun() -&gt; phil(2, S2, S3) end),
  spawn(fun() -&gt; phil(3, S3, S4) end),
  spawn(fun() -&gt; phil(4, S4, S5) end),
  fun() -&gt; phil(5, S1, S2).

phil(N,SL,SR) -&gt;
  base:printLn(base:show(N)++" thinks"),
  take(SL),
  take(SR),
  base:printLn(Base:show(N)++" eats"),
  put(SL),
  put(SR),
  phil(N,SL,SR).
</pre>

<pre class="example">
new_mvar() -&gt; spawn(fun() -&gt; empty() end).

empty() -&gt;
  receive
    {put,V,P} -&gt; P!put, % schreiber blockieren
                 full(V)
  end.

full(V) -&gt;
  receive
    {take,P} -&gt; P!{took,V},
                empty()
  end.

take_mvar(MVar) -&gt;
  MVar!{take, self()},
  receive
    {took,V} -&gt; V
  end.

put_mvar(MVar,V) -&gt;
  MVar!{put,V,self()},
  receive
    put -&gt; ok
  end.

clear_mvar(MVar) -&gt;
</pre>

<p>
Knoten auf Server starten: <code>erl -name &lt;Knotenname&gt;</code> oder
<code>erl -sname &lt;Knotenname&gt;</code>
</p>

<p>
Prozesse auf dem Server registrieren: <code>register(&lt;Name&gt;, &lt;pit&gt;).</code>
</p>

<p>
Danach können Nachrichten an den registierten Service geschickt werden:
<code>{&lt;Name&gt;, &lt;Knoten&gt;}!&lt;Nachricht&gt;</code>. Für Antworten kann der Sender seine
PID mitschicken.
</p>

<p>
chatServer:
</p>

<pre class="example">
-module(chatServer).
-export([start/0]).
-import(base,[lookup/2]).

start() -&gt; register(chat, self()), server_loop([]).

server_loop(Clients) -&gt;
  receive
    {login,Name,P} -&gt; case lookup(Name,Clients) of
      nothing -&gt; P!{welcome, map(fun({X,_}) -&gt; X end, Clients), self()},
                 ...
                 server_loop([{Name,P}|Clients]);
      {just,_} -&gt; P!name_occupied.
                 server_loop([{Name,P}|Clients])
                 end;
    {logout,P} -&gt; NewClients = lists:keydelete(P,2,Clients),
                  case lists:keyfind(P,2,Cleints) of
                    false -&gt; server_loop(Clients);
                    {Name,_} -&gt; NewClients = lists:keydelete(P,2,Clients),
                                broadcast(NewClients,{logout,Name}),
                                server_loop(NewClients).
                  end.
    {message,Msg,P} -&gt;
                  case lists:keyfind(P,2,Clients) of
                    false -&gt; server_loop(Clients);
                    {Name,_} -&gt; broadcast(Clients,{message,Name}),
                                server_loop(Clients).
                  end.

    Msg -&gt; println("Not implemented yet:"++show(Msg)),
           server_loop(Clients)
  end.

broadcast(Clients) -&gt;
</pre>

<p>
chatClient:
</p>

<pre class="example">
-module(chatClient).
-export([joinChat/2]).

joinChat(Name, ServerNode) -&gt;
  {chat,ServerNode}!{login,Name,self()},
  receive
    {welcome,Names,Server} -&gt; println(Names),
                              Me = self(),
                              Client spawn(fun() -&gt; user_input(Server, Name, Me) end),
                              client_loop();
    name_occupied -&gt; printLn("Name bereits vergeben")
  after 2000 -&gt; printLn("Keine Verbindung")
  end.

user_input(Server, Name, Me) -&gt;
  Str = getLn(Name++"&gt; "),
  case Str of
    "bye" -&gt; Server!{logout,Me},
    _ -&gt; Server!{message, Str, Me}
  end,
  user_input(Server, Name, Me).

client_loop() -&gt;
  receive
    {loogout, Name} -&gt; printLn(Name++" hat den Chat verlassen."),
                       client_loop();
    {message, Msg, Name} -&gt; printLn(Name++"
</pre>

<p>
Verknüpfung von Prozessen mit <code>spawn_link(&lt;FUN&gt;)</code> oder <code>link(&lt;PID&gt;)</code>
</p>

<p>
Verhindern, mit einem verlinkten Prozess zu sterben:
<code>process_flag(trap_exit, true)</code>. Dann erhalten wir eine Message, wenn
der verlinkte Prozess stirbt.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Generic Server</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Modul <code>gen_server</code>.
</p>

<p>
Chat unter Verwendung von Genserver
</p>

<pre class="example">
-module(genChat).
-behaviour(gen_server). % Behaviour-Klasse, geladen wie Modul ähnlich wie abstraktes Interface, welche zu implementieren ist
-export([start/0]).
-export([login/0, msg/2, logout/1, who/1]).
-export([init/0, handle_call/3, handle_cast/2, handle_info/2, terminate/2, code_change/3]).

start() -&gt; base:printLn("Server started"),
gen_server:start_link({local,chat},genChat,[],[]). % Code für Server im Modul genChat

init() -&gt; {ok,[]}.

% asynchronous interface
handle_cast({message, Text, P}, Clients) -&gt; % Clients sind automatisch bekannt
    ... COde
    {noreply,Clients}; % sagt dem Server, dass er den Clients nicht antworten muss
    {noreply, &lt;Neuer Zustand&gt;}
handle_cast(...)

% synchronous interface
handle_call({login, Name})
    ...
    {reply, &lt;Message&gt;, &lt;neuer Zustand&gt;} 

terminate(shutdown, _) -&gt; ok.

code_change(_OldVsn, _Extra) -&gt; {ok, State}.

% client interface

login(Node, Name) -&gt; gen_server:call({chat_Nod}, {login, Name}).

msg(Pid, Msg) -&gt; gen_server:cast(Pid, {message, Msg, self()}).
</pre>

<p>
Chat Client mit gen\<sub>server</sub>
</p>

<p>
```` -module(genChatClient).
</p>

<p>
lokales Dictionary mit Key-Value-Paaren:
</p>

<p>
<code>put(42, hallo)</code> und <code>get(42)</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Behaviours</h3>
<div class="outline-text-3" id="text-2-6">
<p>
In Anwendungen gibt es oft einen <b>supervision tree</b>, d.h.
</p>

<ul class="org-ul">
<li>Aufteilungen in worker- und supervisor-Processe
</li>
<li>worker-Prozesse führen Berechnungen durch
</li>
<li>supervisor-Prozesse kontrollieren das Verhalten der worker-Prozesse
</li>
</ul>

<p>
Die Idee von <b>Behaviours</b> fußt auf der Beobachtung, dass im
supervision-tree viele Prozesse ähnliche Aufgaben erfüllen. Behaviours
dienen dazu die gemeinsamen Strukturen herauszuabstrahieren und den
gesamten Code zu zerlegen in:
</p>

<ul class="org-ul">
<li>einen generischer Code-Teil (behaviour)
</li>
<li>einen anwendungsspezifische Code-Teil (callback module)
</li>
</ul>

<p>
Beispiele:
</p>

<ul class="org-ul">
<li>gen<sub>server</sub>: Implementierung von Client-Server-Kommunikation
</li>
<li>gen<sub>fsm</sub>: Implementierung von finit state machines (veraltete)
</li>
<li>gen<sub>statem</sub>: Implementierung von event-driven state machines (neu)
</li>
<li>gen<sub>event</sub>: Implementierung von event-handling
</li>
<li>supervisor: Implementierung eines supervisors
</li>
</ul>
</div>

<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Vorteile</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>Wiederverwendbarkeit
</li>
<li>Kommunikationsprotokoll ist versteckt und kann ggf. leicht
ausgetauscht werden
</li>
<li>bessere Wartbarkeit/Erweiterbarkeit
</li>
<li>oftmals leichter verständlicherer Code
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> Franks Stack implementierung in Erlang</h3>
</div>
</div>
